app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_name", "body", "idea_id", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "tets"], ["body", "testt"], ["idea_id", 1], ["picture", "Penguins.jpg"], ["created_at", "2016-04-03 04:12:05.912420"], ["updated_at", "2016-04-03 04:12:05.912420"]]
---
  def create
    @comment = Comment.new(comment_params)


    respond_to do |format|
  if @comment.save