app/controllers/ideas_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  ORDER BY "comments"."like_count" DESC  [["idea_id", 1]]
---
  def show
   @comments = @idea.comments.order(like_count: :desc).all

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["description", "b"], ["picture", "Desert.jpg"], ["created_at", "2016-04-03 03:08:40.217722"], ["updated_at", "2016-04-03 03:08:40.217722"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "name" = ?, "description" = ?, "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "strawberry"], ["description", "taste"], ["picture", "strawberry.JPG"], ["updated_at", "2016-04-03 05:52:54.385923"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)